# -*- coding: utf-8 -*-
"""
Created on Wed Apr 17 15:49:51 2019

@author: Tsutomu
"""

import time,json
import pandas

code = ['000157','000425','000528','000666','000680','000821',
        '000852','000923','000925','002008','002021','002031',
        '600031','600055','600169','600262','600302','600343',
        '600388','600499','600526','600582','600587','600761',
        '600815','600843','600855','600860','600879','300056',
        '002490','601106','002430','002435','002459','002526',
        '300151','300156','601717','002278','002337','002353']

clu = ['STARTDATE','ENDDATE','SECNAME','SECCODE',
       'F042N','F043N','F041N','F039N',
       'F023N','F029N','F022N','F025N',
       'F017N','F020N','F016N','F081N',
       'F052N','F056N','F053N','F054N']
date_start = ['2013-01-01','2014-01-01','2015-01-01','2016-01-01','2017-01-01']
              
date_end = ['2013-12-31','2014-12-31','2015-12-31','2016-12-31','2017-12-31']

for scode in code:
    df = pandas.read_json(scode+'.json', encoding = "utf-8")
    
    
    tmp = df[df['STARTDATE'].isin(date_start)]
    tmp = tmp[tmp['ENDDATE'].isin(date_end)]
    tmp2 =tmp[clu]
    
    # 去除重复行
    tmp2 = tmp2.drop_duplicates(['STARTDATE'])
    
    tmp2.rename(columns={'STARTDATE':'开始日期','ENDDATE':'结束日期','SECNAME':'公司名','SECCODE':'股票代码',
           'F042N':'流动比率','F043N':'速动比率','F041N':'资产负债率','F039N':'产权比率',
           'F023N':'存货周转率','F029N':'流动资产周转率','F022N':'应收账款周转率','F025N':'总资产周转率',
           'F017N':'营业净利率','F020N':'成本费用利润率','F016N':'总资产报酬率','F081N':'平均净资产收益率',
           'F052N':'营业收入增长率','F056N':'总资产增长率','F053N':'净利润增长率','F054N':'净资产增长率'}, inplace=True)
    
    
    tmp2.to_csv('washeddata\\'+scode+'.csv', encoding = "utf_8_sig")

